[
  {
    "id": "0",
    "title": "Senior Software Engineer",
    "date": "Mar 2023 - Present",
    "location": "Loop",
    "description": "I joined Loop during a pivotal phase as the company transitioned from outsourced development to building an in-house engineering team. This opportunity allowed me to drive key platform enhancements and establish processes to improve collaboration across the organization.\n\nKey Highlights:\n • Led major client projects, including a large-scale Takealot integration, recognized as one of Loop’s most successful technical endeavors.\n • Designed and implemented a System Monitoring Framework, enabling proactive decision-making through data insights.\n • Worked closely with cross-functional teams to refine processes, improve workflows, and enhance user experiences."
  },
  {
    "id": "1",
    "title": "Co-founder",
    "date": "May 2022 - Jun 2023",
    "location": "LEKR Services",
    "description": "Co-Founded LEKR SERVICES to provide freelance software development services while building an internal product aimed at automating business tools for small to medium-sized enterprises. This experience involved acquiring clients, understanding their business needs, and delivering tailored technical solutions.\n\nKey Highlights:\n • Built strong client relationships across various industries, translating business needs into scalable solutions.\n• Delivered custom software that provided tangible value, improving client workflows and business operations.\n • Developed an internal tool to automate key business functions like quote generation, invoicing, and lead management, enhancing efficiency for SMEs.\n • Gained valuable business acumen, managing client interactions and leading end-to-end solution delivery"
  },
  {
    "id": "2",
    "title": "Full Stack Software Engineer",
    "date": "Aug 2020 - Apr 2022",
    "location": "MOHARA",
    "description": "At MOHARA, an international consultancy with development hubs across the UK, South Africa, and Thailand, I progressed from Full Stack Engineer to Project Tech Lead. I led projects from initial concept to successful product launch across various industries, including FinTech, HealthTech, and PropertyTech.\n\nKey Highlights:\n • Led and managed diverse teams, guiding projects from ideation to market launch.\n • Worked closely with clients to translate business requirements into technical solutions, conducting solution design sessions.\n • Gained experience across multiple industries, quickly adapting to the unique challenges of each sector.\n • Played a pivotal role in business development by fostering relationships with clients and identifying new opportunities."
  },
  {
    "id": "3",
    "title": "Intern",
    "date": "Dec 2017 - Jan 2020",
    "location": "SOLIDitech",
    "description": "During my internship at SOLIDitech, I gained practical experience in real-world software development projects while balancing my university studies. I worked directly with different teams across the business, contributing to production code and client projects.\n\nKey Highlight:\n • Co-led the development of an internal testing tool featuring a browser-based Java compiler with automated code testing and feedback. This tool remains a key part of the company’s recruitment process today.\n\nThis hands-on experience provided a strong foundation in both front-end and back-end development, as well as client interaction and delivering value-driven solutions."
  },
  {
    "id": "4",
    "title": "Bsc, Mathematical Sciences & Computer Science",
    "date": "Jan 2017 - Jan 2020",
    "location": "University of Stellenbosch",
    "description": "Bachelor of Science degree majoring in Mathematics and Computer Science."
  }
]
